УТ/src/Catalogs/CRM_ГруппыПолучателей/CRM_ГруппыПолучателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ГруппыПолучателей</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>Персональная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_СоставыГруппПолучателей/CRM_СоставыГруппПолучателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СоставыГруппПолучателей</name>
  <dimensions>
    <name>ГруппаПолучателей</name>
    <type>
      <types>CatalogRef.CRM_ГруппыПолучателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/CRM_ГруппыПолучателей/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТолькоПросмотр = (ТекущийПользователь <> Объект.Владелец);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		НаборЗаписейКопирования = РегистрыСведений.CRM_СоставыГруппПолучателей.СоздатьНаборЗаписей();
		НаборЗаписейКопирования.Отбор.ГруппаПолучателей.Установить(ЗначениеКопирования);
		НаборЗаписейКопирования.Прочитать();
		
		Если НаборЗаписейКопирования.Количество() > 0 Тогда
			
			НаборЗаписейНовый = РегистрыСведений.CRM_СоставыГруппПолучателей.СоздатьНаборЗаписей();
			НаборЗаписейНовый.Отбор.ГруппаПолучателей.Установить(Объект.Ссылка);
			
			Для Каждого Запись Из НаборЗаписейКопирования Цикл
				НоваяЗапись = НаборЗаписейНовый.Добавить();
				НоваяЗапись.ГруппаПолучателей = Объект.Ссылка;
				НоваяЗапись.Получатель = Запись.Получатель;
			КонецЦикла;
			
			НаборЗаписейНовый.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
